pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32F1655_56_FWLib_v102_960/library/HT32F1655_56_Driver/src/ht32f1655_56_gptm.c
/*********************************************************************************************************//**
 * @brief Initialize the GPTMx channel N output.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param OutInit: Point to a \ref GPTM_OutputInitTypeDef structure that contains
                   the configuration information.
 * @retval None
 ************************************************************************************************************/
void GPTM_OutputInit(HT_GPTM_TypeDef* GPTMx, GPTM_OutputInitTypeDef* OutInit)
{
  vu32 *pOcfr = (vu32*)&GPTMx->CH0OCFR + OutInit->Channel;
  vu32 *pCcr = (vu32*)&GPTMx->CH0CCR + OutInit->Channel;
  vu32 *pAcr = (vu32*)&GPTMx->CH0ACR + OutInit->Channel;
  u8 bChPos = OutInit->Channel << 1;
  u32 wTmpMask = ~(0x1ul << bChPos);

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(OutInit->Channel));
  Assert_Param(IS_GPTM_OM(OutInit->OutputMode));
  Assert_Param(IS_GPTM_CHCTL(OutInit->Control));
  Assert_Param(IS_GPTM_CHP(OutInit->Polarity));

  /* Disable the Channel                                                                                    */
  GPTMx->CHCTR &= wTmpMask;

  /* Set the Output Compare Polarity                                                                        */
  GPTMx->CHPOLR &= wTmpMask;
  GPTMx->CHPOLR |= (u32)OutInit->Polarity << bChPos;

  /* Select the Output Compare Mode                                                                         */
  *pOcfr &= CHOCFR_CHOM_MASK;
  *pOcfr |= OutInit->OutputMode;

  /* Set the Capture Compare Register value                                                                 */
  *pCcr = OutInit->Compare;

  /* Set the Asymmetric Compare Register value                                                              */
  *pAcr = OutInit->AsymmetricCompare;

  /* Set the channel state                                                                                  */
  GPTMx->CHCTR |= (u32)OutInit->Control << bChPos;
}

/*********************************************************************************************************//**
 * @brief Initialize input capture of the GPTMx channel.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param CapInit: Point to a \ref GPTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void GPTM_CaptureInit(HT_GPTM_TypeDef* GPTMx, GPTM_CaptureInitTypeDef* CapInit)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH(CapInit->Channel));
  Assert_Param(IS_GPTM_CHP(CapInit->Polarity));
  Assert_Param(IS_GPTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_GPTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_GPTM_FILTER(CapInit->Filter));

  gptm_CHx_Config(GPTMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  GPTM_CHPSCConfig(GPTMx, CapInit->Channel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Configure the GPTMx to measure an external PWM signal.
 * @param GPTMx: where GPTMx is the selected GPTM from the GPTM peripheral.
 * @param CapInit: Point to a \ref GPTM_CaptureInitTypeDef structure that contains the configuration
 *                information.
 * @retval None
 ************************************************************************************************************/
void GPTM_PwmInputInit(HT_GPTM_TypeDef* GPTMx, GPTM_CaptureInitTypeDef* CapInit)
{
  GPTM_CHP_Enum OppositePol;
  GPTM_CHCCS_Enum OppositeSel;
  GPTM_CH_Enum OppositeChannel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_GPTM(GPTMx));
  Assert_Param(IS_GPTM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_GPTM_CHP(CapInit->Polarity));
  Assert_Param(IS_GPTM_CHCCS(CapInit->Selection));
  Assert_Param(IS_GPTM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_GPTM_FILTER(CapInit->Filter));

  /* Select the Opposite Input Polarity                                                                     */
  if (CapInit->Polarity == GPTM_CHP_NONINVERTED)
  {
    OppositePol = GPTM_CHP_INVERTED;
  }
  else
  {
    OppositePol = GPTM_CHP_NONINVERTED;
  }

  /* Select the Opposite Input                                                                              */
  if (CapInit->Selection == GPTM_CHCCS_DIRECT)
  {
    OppositeSel = GPTM_CHCCS_INDIRECT;
  }
  else
  {
    OppositeSel = GPTM_CHCCS_DIRECT;
  }

  if (CapInit->Channel == GPTM_CH_0)
  {
    OppositeChannel = GPTM_CH_1;
  }
  else
  {
    OppositeChannel = GPTM_CH_0;
  }

  /* CH0 Configuration                                                                                    */
  gptm_CHx_Config(GPTMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                */
  GPTM_CHPSCConfig(GPTMx, CapInit->Channel, CapInit->Prescaler);

  /* CH1 Configuration                                                                                    */
  gptm_CHx_Config(GPTMx, OppositeChannel, OppositePol, OppositeSel, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                */
  GPTM_CHPSCConfig(GPTMx, OppositeChannel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Fill each TimeBaseInit member with its default value.
 * @param TimeBaseInit: Point to a \ref GPTM_TimeBaseInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void GPTM_TimeBaseStructInit(GPTM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Set the default configuration                                                                          */
  TimeBaseInit->CounterMode = GPTM_CNT_MODE_UP;
  TimeBaseInit->CounterReload = 0xFFFF;
  TimeBaseInit->Prescaler = 0x0000;
  TimeBaseInit->PSCReloadTime = GPTM_PSC_RLD_IMMEDIATE;
}

